document.addEventListener('DOMContentLoaded', function () {
    const texts = [
        "сейчас так холодно снаружи, так тихо и пусто…легкий морозный ветерок…румянисты щёчки и носик…солнце находящиеся в небе совсем сейчас не греющие…но как же мне повезло, что у меня есть своё солнышко.) которое меня греет не зависимо от времени года. когда ты присутствуешь рядом со мной, незаметно тепло становится, как будто и холодно не было…даже лишь твоя улыбка может заставить моё сердце биться чаще, а от твоих прикосновений тело всё в мурашках…как же приятно быть с тобой…мне будет достаточно что ты просто будешь находиться рядом со мной, я буду просто необычайно счастлива если смогу просто наблюдать как красиво зимний ветер обдувает волосы твои, как мило извивается на шее шарф…а я подойду и обниму тебя крепко, чтобы наши с тобой сердца прикоснулись друг дружке",
        "ты мой самый любимый человек, самый лучший в моей жизни. правда, ты мне очень дорог. я рада что нашла тебя, среди тысячи других. я буду всегда тебя любить, а знаешь почему?\nпотому что ты для меня стал как родным человеком, и ты не представляешь как я тебя вижу, у меня глаза горят от твоего вида, я смотрю на тебя, я вижу что ты очень милый прекрасный человек, у тебя такие красивые глаза, красивая улыбка, красивые волосы, твой характер, твоя внутренняя душа, и когда ты рядом со мной, ты делаешь меня таким счастливым человеком, и я очень рада что мы можем доверять друг другу, созваниваться, писать друг другу и рассказывать много много чего.\nя готова тебе помочь поддержать, главное чтобы ты чувствовал себя хорошо.\nзапомни я рядом, я готова тебя выслушать, быть рядом когда тебе плохо, потому что ты для меня любимый человек.",
        "солнце, хотелось бы тебя сказать как сильно я тебя люблю… ты для меня стал самым родным человеком из всех, роднее моей семьи, я тебя так сильно люблю, спасибо тебе большое за каждую секунду проведённую с тобой, это для меня настолька ценно, я обожаю тебя, обожаю полностью, ты самый дучший на свете, я люблю тебя настолько сильно…я так тебя люблю…я просто не в состоянии описать свои чувства. в моих мыслях крутится так много всего, что я хочу передать это с помощью текстов или каких-нибудь намеков, но я даже двух слов сказать не могу, наверное я слишком много говорю это. говорю, что люблю тебя. я хочу тебе сказать, что я буду любить тебя всегда. там внутри, где-то между беспокойным сердцем и тугими ребрами,ты заполнил всё сияющим светом, я не смогу тебя забыть никогда, чтобы между нами не случилось. ведь ты стал для меня смыслом мой жизни, без тебя я не вижу своего существования…человек который застревает в моих мыслях на протяжении всего дня это ты. каждую минуту, каждую секунду, я думаю о тебе…переживаю за тебя как ненормальная, потому что ты мне очень дорог. не смогу тебя забыть, ведь ты занял всё пространство моего любящего сердца.",
        "когда ты рядом, я чувствую тепло и радость, заботу и нежность, мне уютно и спокойно, когда ты меня обнимаешь. благодаря тебе мы создали маленький мир, в котором нет ничего невозможного. я очень надеюсь, что в этом мире нам всегда будет светло и комфортно. наша встреча стала для меня настоящим чудом. после знакомства с тобой мир наполнился светом, стал ярким, красивым и безграничным. это стало возможно благодаря твоему доброму и любящему сердцу, я люблю тебя и буду беречь тебя. если бы ты был/а последним человеком на земле, я бы приняла это с радостью и смирением. ведь именно ты делаешь этот мир добрым, красивым и полноценным.\nмне не нужен никто, кроме тебя. ты тот человек с которым я готов/а идти с тобой рука об руку до самого финала уверен/а, что встреча с тобой это лучший подаро судьбы. я буду беречь этот подарок и любить тебя всегда. я люблю теб каждыми секундами, минутами, часами, днями и ночами. неделями, месяцами, годами и веками… мы нашли друг друга среди миллиона, и теперь мы как одно целос я не могу без тебя жить, ты нужен/а мне как воздух. без тебя я проста человечек в этом мире, а с тобой я нахожусь на седьмом небе от счастья. когда ты рядом, я чувствую, что нужен/на тебе так же, как и ты мне не думай, что когда тебя нет рядом, я не думаю о тебе. когда ты далеко, я сотни тысяч раз сильнее люблю тебя, я постоянно думаю о тебе и очень сильно тебя люблю.",
        "я просто хочу быть тем самым человеком, я просто хочу быть рядом с тобой. я хочу иметь возможность держать тебя за руку, когда ты переживаешь или грустишь, я хочу иметь возможность крепко обнять тебя, поцеловать, когда тебе одиноко, я хочу иметь возможность поддержать тебя, когда ты чувствуешь, будто распадаешься на кусочки. я хочу подставлять плечо, когда ты плачешь, и быть человеком, в чьи объятия ты угодишь, когда твой мир рушится. я хочу быть человеком, к которому ты будешь приходить за утешением и советами, я хочу быть человеком, который уложит тебя спать, который будет делать тебе завтрак утром и напоминать каждый день от том, что ты прекрасен. я хочу быть человеком, ради которого ты будешь вставать с постели, благодари которому тебе легче пережить еще один день, я хочу помочь тебе поправиться, я хочу помочь тебе пройти через все это, я хочу прожить с тобой счастливую и долгую жизнь. хочу создать с тобой крепкую семью и связать с тобой свою жизнь. и, я хочу и хорошую, и плохую твою сторону, всего тебя. ты всегда и постоянно делаешь меня счастливой. когда ты пишешь мне, мне становится тепло и спокойно, потому что знаю, что ты рядом. я люблю тебя.",
        "эх, знала бы ты. как сильно бьется мое сердце при отправке сообщений и при виде тебя. хочется все время провести с тобой, каждый свободный час просто лежать и по душам общаться. я очень люблю твои милые слова, в которых я чувствую себя комфортно и весь мир переворачивается. при виде твоей улыбки, я на 100% становлюсь счастливее и весь день могу видеть ее. я так рад, что могу каждый день тебя видеть и общаться с тобой. я всегда буду рядом и обязательно буду помогу, я буду рад помочь. я иногда бываю слишком закрытым из-за того, что боюсь сказать чего-то лишнего. я смотрю на тебя и мое сердце просто улетает, а я. таращусь, представляя наш с тобой прекрасный день в будущем. просто так хочется сказать тебе прямо «я тебя люблю» и чтобы это было взаимно. мне снилось уже несколько снов, где мы с тобой вместе, я каждый вечер представляю это себе. слушаю музыку о любви и она заставляет вспоминать тебя все чаще и чаще. твои волосы, глаза, губы, щеки и вообще все части тело так хорошо, но лицо, оно реально самое милое на планете. я тебя очень сильно люблю и прогуляться до парка и поболтать обо всем на свете, это будет лучший мой день. может я тебе не подхожу, но я тебя очень сильно люблю и дорожу тобой. ты мне небезразлична, я очень ценю тебя. мне очень плохо видеть тебя грустным и таким расстроенным иногда, мне самому хуже становится.  умения еще никогда не было такого чувства, которое я ощущаю рядом с тобой. для меня ты особенная и единственная. для меня как бриллиант, изумительный и такой прекрасный. просто знай. я тебя очень сильно люблю",
        "Когда я вижу тебя, кажется, что всё исчезает вокруг. И нет никого и ничего рядом. Только ты. Когда я слышу тебя, твой голос радостным звуком проникает в самое сердце. Если нет тебя рядом, всё меркнет и окрашивается в тёмные цвета. И это самые грустные моменты в жизни. Но стоит нам встретиться как снова всё оживает и расцветает, и приобретает радужные цвета. Так сильно я люблю тебя моя любимая.",
        "вика, малыш, я тебя очень люблю, очень, ты даже не представляешь. я тобой очень сильно дорожу, я хочу что бы мы всегда были вместе и не отходила от друг друга не на минуту. ты стал для меня родным человеком, ты каждый раз меня можешь поддержать и утешить в любую трудную минуту, ты всегда со мной, всегда, ты единственный кто заставил меня сиять и прыгать от радости всего лишь от одного твоего сообщения.",
        "вика, ты самый лучший человек которого я встречала. я могу писать тебе миллионы текстов о том что я тобой очень сильно дорожу, ведь это правда. ты человек, которому я могу полностью открыться и рассказать абсолютно всё! я правда верю в то, что мы с тобой будет общаться долгое время. ты самая лучшая подруга, и единственная кто заставил меня улыбаться. каждое утро я просыпаюсь, и мои мысли только о тебе. спасибо, что ты не бросаешь меня в трудную минуту и всегда со мной. ты просто лучик солнца! только с тобой, я чувствую себя комфортнее. я надеюсь, что мы когда нибудь встретимся и будем гулять с тобой целую вечность и проводить все свое время вдвоём. спасибо тебе,что ты появилась в моей жизни",
    ];
    let usedTexts = [];
    const savedTime = localStorage.getItem('videoTime');
    if (savedTime !== null) {
        const video = document.getElementById('backgroundVideo');
        video.currentTime = savedTime;
        video.play();
    }
    
    function getRandomText() {
        if (texts.length === 0) {
            // Если все тексты уже использовались, начинаем заново
            texts.push(...usedTexts);
            usedTexts = [];
        }

        const randomIndex = Math.floor(Math.random() * texts.length);
        const selectedText = texts.splice(randomIndex, 1)[0];
        usedTexts.push(selectedText);

        return selectedText;
    }

    function updateText() {
      const accoladeElement = document.getElementById('accolade');
      const button = document.getElementById('changeTextButton');
      
      // Удаляем предыдущую анимацию "подъезжания", если она есть
      accoladeElement.classList.remove('slide-in');
  
      // Применяем анимацию "уезжания"
      accoladeElement.classList.add('slide-out');
  
      accoladeElement.addEventListener('animationend', function handler() {
          accoladeElement.removeEventListener('animationend', handler);
  
          // Обновляем текст после окончания анимации "уезжания"
          accoladeElement.textContent = getRandomText();
          
          // Удаляем класс анимации "уезжания"
          accoladeElement.classList.remove('slide-out');
  
          // Применяем анимацию "подъезжания"
          accoladeElement.classList.add('slide-in');
      });
  }
    try {
        particlesJS("particles-js", {
            "particles": {
              "number": {
                "value": 355,
                "density": {
                  "enable": true,
                  "value_area": 789.1476416322727
                }
              },
              "color": {
                "value": "#ffffff"
              },
              "shape": {
                "type": "circle",
                "stroke": {
                  "width": 0,
                  "color": "#000000"
                },
                "polygon": {
                  "nb_sides": 5
                },
                "image": {
                  "src": "img/github.svg",
                  "width": 100,
                  "height": 100
                }
              },
              "opacity": {
                "value": 0.48927153781200905,
                "random": false,
                "anim": {
                  "enable": true,
                  "speed": 0.2,
                  "opacity_min": 0,
                  "sync": false
                }
              },
              "size": {
                "value": 2,
                "random": true,
                "anim": {
                  "enable": true,
                  "speed": 2,
                  "size_min": 0,
                  "sync": false
                }
              },
              "line_linked": {
                "enable": false,
                "distance": 150,
                "color": "#ffffff",
                "opacity": 0.4,
                "width": 1
              },
              "move": {
                "enable": true,
                "speed": 0.2,
                "direction": "none",
                "random": true,
                "straight": false,
                "out_mode": "out",
                "bounce": false,
                "attract": {
                  "enable": false,
                  "rotateX": 600,
                  "rotateY": 1200
                }
              }
            },
            "interactivity": {
              "detect_on": "canvas",
              "events": {
                "onhover": {
                  "enable": true,
                  "mode": "bubble"
                },
                "onclick": {
                  "enable": true,
                  "mode": "push"
                },
                "resize": true
              },
              "modes": {
                "grab": {
                  "distance": 400,
                  "line_linked": {
                    "opacity": 1
                  }
                },
                "bubble": {
                  "distance": 83.91608391608392,
                  "size": 1,
                  "duration": 3,
                  "opacity": 1,
                  "speed": 3
                },
                "repulse": {
                  "distance": 200,
                  "duration": 0.4
                },
                "push": {
                  "particles_nb": 4
                },
                "remove": {
                  "particles_nb": 2
                }
              }
            },
            "retina_detect": true
          });     

    } catch (error) {
        console.error('Ошибка при инициализации particles.js', error);
    }    
  
    // Убедитесь, что удаляется класс анимации "подъезжания" после ее завершения
    const accoladeElement = document.getElementById('accolade');
    accoladeElement.addEventListener('animationend', function handler() {
        if (accoladeElement.classList.contains('slide-in')) {
            accoladeElement.classList.remove('slide-in');
        }
    });

    // При загрузке страницы
    updateText();

    // При нажатии на кнопку
    const button = document.getElementById('changeTextButton');
});